================================================================================
Function call no args
================================================================================

now()

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)))

================================================================================
Function call single arg
================================================================================

count(items)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (identifier)))

================================================================================
Function call multiple args
================================================================================

coalesce(a, b, c)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (identifier)
    (identifier)
    (identifier)))

================================================================================
Order function with asc
================================================================================

order(name asc)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (asc_expression
      expression: (identifier))))

================================================================================
Order function with desc
================================================================================

order(releaseYear desc)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (desc_expression
      expression: (identifier))))

================================================================================
Order function multiple fields
================================================================================

order(category asc, name desc)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (asc_expression
      expression: (identifier))
    (desc_expression
      expression: (identifier))))

================================================================================
Defined function
================================================================================

defined(field)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (identifier)))

================================================================================
References function
================================================================================

references("doc-123")

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (string
      (double_quoted_string))))

================================================================================
Select function with pairs
================================================================================

select(x > 10 => "high", x > 5 => "medium", "low")

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (pair
      condition: (comparison_expression
        left: (identifier)
        right: (number))
      value: (string
        (double_quoted_string)))
    (pair
      condition: (comparison_expression
        left: (identifier)
        right: (number))
      value: (string
        (double_quoted_string)))
    (string
      (double_quoted_string))))

================================================================================
Length function
================================================================================

length(name)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (identifier)))

================================================================================
Path function
================================================================================

path("content.body")

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (identifier)
    (string
      (double_quoted_string))))

================================================================================
Function definition no params
================================================================================

fn myFunc() = "hello"

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    body: (string
      (double_quoted_string))))

================================================================================
Function definition with params
================================================================================

fn add($a, $b) = $a + $b

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    (parameter_list
      (variable)
      (variable))
    body: (binary_expression
      left: (variable)
      right: (variable))))

================================================================================
Function definition with projection body
================================================================================

fn getFields($content) = $content{ name, title }

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    (parameter_list
      (variable))
    body: (projection_expression
      base: (variable)
      projection: (projection
        (identifier)
        (identifier)))))

================================================================================
Multiple function definitions
================================================================================

fn helper($x) = $x * 2
fn main($y) = helper($y)

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (identifier)
    (parameter_list
      (variable))
    body: (binary_expression
      left: (variable)
      right: (number)))
  (function_definition
    name: (identifier)
    (parameter_list
      (variable))
    body: (function_call
      name: (identifier)
      (variable))))

================================================================================
Namespaced function definition
================================================================================

fn myNamespace::unfurl($url) = $url + "/api";

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (parameter_list
      (variable))
    body: (binary_expression
      left: (variable)
      right: (string
        (double_quoted_string)))))

================================================================================
Namespaced function call
================================================================================

geo::distance(point1, point2)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (identifier)
    (identifier)))

================================================================================
Namespaced function call pt::text
================================================================================

pt::text(body)

--------------------------------------------------------------------------------

(source_file
  (function_call
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (identifier)))

================================================================================
Function definition with query body
================================================================================

fn myApp::getPosts($type) = *[_type == $type];

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (parameter_list
      (variable))
    body: (subscript_expression
      base: (everything)
      index: (comparison_expression
        left: (identifier)
        right: (variable)))))

================================================================================
Multiple namespaced function definitions with expression
================================================================================

fn utils::double($x) = $x * 2;
fn utils::add($a, $b) = $a + $b;
utils::add(1, utils::double(2))

--------------------------------------------------------------------------------

(source_file
  (function_definition
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (parameter_list
      (variable))
    body: (binary_expression
      left: (variable)
      right: (number)))
  (function_definition
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (parameter_list
      (variable)
      (variable))
    body: (binary_expression
      left: (variable)
      right: (variable)))
  (function_call
    name: (namespaced_identifier
      namespace: (identifier)
      name: (identifier))
    (number)
    (function_call
      name: (namespaced_identifier
        namespace: (identifier)
        name: (identifier))
      (number))))
